# GetDXFColorToLW

## Description
Get DXF color to lineweight

```pascal
FUNCTION GetDXFColorToLW(dxfClrIndex : INTEGER): INTEGER;
```

```python
def vs.GetDXFColorToLW(dxfClrIndex):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dxfClrIndex|INTEGER|   |

## Version
Availability: from Vectorworks 2013

## Category
* ImportExport